/////////////////////////////////////////////////////////////////////////////////
//设计项目:模拟开关控制指示灯设计实验                                          //
//设 计 人:畅福善                                                              //
//设计时间:2014.4.27                                                           //
//设计说明:设计一个开关计数器， 实现一个模拟开关连续计数，控制8个LED指示灯显示 //
//         硬件连接条件:1、单片机P0.0~P0.7依次连接第1~8个LED指示灯             //
//                      2、4个模拟开关依次连接到P3.4,P3.5,P3.6,P3.7            //
/////////////////////////////////////////////////////////////////////////////////
//#include <AT89X51.H> 
#include "STC15F2K60S2.H"
////////函数说明////////
void delay02s(void);		//延时2秒子程序//
void delay10ms(void);		//延时10ms的子程序//
void delay50us(void);		//延时50us的子程序//
void alarm_buzzer(void);	//报警子程序//
void key(void);             //按键函数
void display(void);         //显示函数//
//extern One_key_multifunction(void);//外部引用的一键多功能按键函数
//void Display_function_with_a_parameter(unsigned char x);//带参数的显示函数
extern void led_a(void);         //多花色显示函数
////////变量说明////////
unsigned  char count;/////////计数器
bit alarm_con;/////报警控制标志
//extern unsigned  char key_counter;/////////按键计数器
extern unsigned  char Addition_and_subtracting_counter;/////////加减按键计数器
//unsigned  char k;

//extern unsigned  char move_bit1,move_bit2;/////////移位变量

///led定义///////SFR位定义/////位定义///
sbit L1=P1^0;//////定义第1个指示灯的名称为L1  还可以直接采用P0_0;因为AT89X51.H内部已做定义,下依次类推
sbit L2=P1^1;//////定义第2个指示灯的名称为L2 
sbit L3=P1^2;//////定义第3个指示灯的名称为L3  
sbit L4=P1^3;//////定义第4个指示灯的名称为L4 
sbit L5=P1^4;//////定义第5个指示灯的名称为L5  
sbit L6=P1^5;//////定义第6个指示灯的名称为L6 
sbit L7=P1^6;//////定义第7个指示灯的名称为L7  
sbit L8=P1^7;//////定义第8个指示灯的名称为L8

sbit fmq=P3^2;//////定义fmq为蜂鸣器控制端
 
//按键定义
sbit key_1=P3^4;//////定义第1个按键为KEY_1
sbit key_2=P3^5;//////定义第1个按键为KEY_2
sbit key_3=P3^6;//////定义第1个按键为KEY_3
sbit key_4=P3^7;//////定义第1个按键为KEY_4
/////////////////////////////
void main(void) 			//主程序//
{
/////////初始化区////////////////
P3=0xff;/////初始化P3口准备读取按键（按键输入）
///////蜂鸣器测试程序/////////////
//P32=0;
//delay02s();delay02s();delay02s();delay02s();delay02s();
//P32=1;
alarm_buzzer();
//蜂鸣器初始化
	while(1) 			    //进入循环//以下为无限循环程序区
     	{ 
		 key(); 			//调用按键函数//
		 display();         //调用显示函数//
//		One_key_multifunction(); 
//		Display_function_with_a_parameter(key_counter);         //调用显示函数//
        } 
}

///////////////////////////////////////////////////
//函数名称:void key(void)
//函数功能:按键函数
//入口参数:
//出口参数:
//函数说明:
///////////////////////////////////////////////////
void key(void)      //按键函数
{
	if(key_1==0)/////////如果按键按下
	{
	  delay10ms();///////延时10ms 越过抖动区7ms
	  if(key_1==0)///////按键的确按下
	    {
		alarm_buzzer();
		//P32=0;/////按键音开
		count++;///////按键计数器计数
		if(count>=10){count=9;}//////控制计数器最大值;16即为16进制;20即为20进制;但最大计数255，因为count定义的是unsigend char
		//P0=~count;///////将计数值送P0口利用LED指示灯以BCD码（8421码）显示
		while(key_1==0){;}///////按键等待抬起
		//P32=1;/////按键音关
		}
	}
	if(key_2==0)/////////如果按键按下
	{
	  delay10ms();///////延时10ms 越过抖动区7ms
	  if(key_2==0)///////按键的确按下
	    {
		alarm_buzzer();
		//P32=0;/////按键音开
		count--;///////按键计数器计数
		if(count>=100){count=0;}//////控制计数器最大值;16即为16进制;20即为20进制;但最大计数255，因为count定义的是unsigend char
		//P0=~count;///////将计数值送P0口利用LED指示灯以BCD码（8421码）显示
		while(key_2==0){;}///////按键等待抬起
		//P32=1;/////按键音关
		}
	}
	if(key_3==0)/////////如果按键按下
	{
	  delay10ms();///////延时10ms 越过抖动区7ms
	  if(key_3==0)///////按键的确按下
	    {
		alarm_con=!alarm_con;/////控制报警音标志
		while(key_3==0){;}///////按键等待抬起
		}
	}

}

///////////////////////////////////////////////////
//函数名称:void display(void)
//函数功能:显示函数
//入口参数:
//出口参数:
//函数说明:
///////////////////////////////////////////////////
void display(void)      //显示函数
{
	P1=~count;///////将计数值送P0口利用LED指示灯以BCD码（8421码）显示
}

///////////////////////////////////////////////////
//函数名称:void Display_function_with_a_parameter(unsigned char x)
//函数功能:带参数的显示函数
//入口参数:
//出口参数:
//函数说明:
///////////////////////////////////////////////////
void Display_function_with_a_parameter(unsigned char x)      //显示函数
{
//////////////持续显示程序/////////////////////////////

if(x==2){P0=~Addition_and_subtracting_counter;}///////将计数值送P0口利用LED指示灯以BCD码（8421码）显示
//if(x==2){P0=~move_bit2;}///////将计数值送P0口利用LED指示灯以BCD码（8421码）显示
if(x==3){led_a();}
}
///////////////////////////////////////////////////
//函数名称:void alarm_buzzer(void)
//函数功能:报警子程序
//入口参数:
//出口参数:
//函数说明:
///////////////////////////////////////////////////
void alarm_buzzer(void)		//延时10ms的子程序//
{ 		
		unsigned int k; /////局部变量定义
		for(k=500;k>0;k--) ////内层循环
		{
		fmq=0;
		delay50us();delay50us();
		fmq=1;
		delay50us();delay50us();
		}
}  
///////////////////////////////////////////////////
//函数名称:void delay50us(void)
//函数功能:延时50us秒的子程序
//入口参数:
//出口参数:
//函数说明:
///////////////////////////////////////////////////
void delay50us(void)		//延时10ms的子程序//
{ 		
		unsigned int k; /////局部变量定义

			for(k=50;k>0;k--) ////内层循环
				{
				;
				}

}  
///////////////////////////////////////////////////
//函数名称:void delay10ms(void)
//函数功能:延时10ms秒的子程序
//入口参数:
//出口参数:
//函数说明:
///////////////////////////////////////////////////
void delay10ms(void)		//延时10ms的子程序//
{ 		
//		unsigned char i,j,k; /////局部变量定义
		unsigned char j,k; /////局部变量定义
//  		for(i=20;i>0;i--)   //最外层循环
//			{
		    	for(j=20;j>0;j--)   // 上层循环
					{
				  		for(k=248;k>0;k--) ////内层循环
							{
							;
							}
					}
//			}
}  
///////////////////////////////////////////////////
//函数名称:void delay02s(void)
//函数功能:延时0.2秒的子程序
//入口参数:
//出口参数:
//函数说明:
///////////////////////////////////////////////////
void delay02s(void)		//延时子程序//
{ 		
		unsigned char i,j,k; /////局部变量定义
  		for(i=20;i>0;i--)   //最外层循环
			{
		    	for(j=20;j>0;j--)   // 上层循环
					{
				  		for(k=248;k>0;k--) ////内层循环
							{
							;
							}
					}
			}
} 
