//////////////////////////////////////////////////////////////////
//设计项目:1个LED实验                                           //
//设 计 人:王志俊                                               //
//设计时间:2021.11.1                                            //
//设计说明:实现一个或多个LED指示灯，按照不同要求花色运行        //
//         硬件连接条件:单片机P1.0~P1.7依次连接第1个LED~第8个LED//
//                                                              //
//////////////////////////////////////////////////////////////////
#include "STC15F2K60S2.H" 
////////函数说明//////////
void led_1(void);       //2个指示灯同时亮、灭循环（间隔0.2秒）
void led_2(void);		//8个指示灯同时亮、灭循环（间隔0.2秒）
void led_3(void);       //8个LED依次点亮 左移右移（间隔1秒）
void led_3_mov(void);	//8个LED 单一灯（LED）的左移、右移（间隔1秒）
void led_4(void);		//8个指示灯从两边倒中间依次点亮（间隔1秒）
void led_5(void);		//8个指示灯从中间倒两边中间依次点亮（间隔1秒）
void delay02s(void);    //延时0.2s
void delay1s(void);		//延时1s
////////全局变量定义////////
//char data x,y;
////////SFR位重新定义////////

sbit L1=P1^0;//////定义第1个指示灯的名称为L1  还可以直接采用P0_0;因为AT89X51.H内部已做定义,下依次类推
sbit L2=P1^1;//////定义第2个指示灯的名称为L2 
sbit L3=P1^2;//////定义第3个指示灯的名称为L3  
sbit L4=P1^3;//////定义第4个指示灯的名称为L4 
sbit L5=P1^4;//////定义第5个指示灯的名称为L5  
sbit L6=P1^5;//////定义第6个指示灯的名称为L6 
sbit L7=P1^6;//////定义第7个指示灯的名称为L7  
sbit L8=P1^7;//////定义第8个指示灯的名称为L8 

//主程序//
void main(void)
{
	while(1)
	{
		//led_1();//2个指示灯同时亮、灭循环（间隔0.2秒）
		//led_2();//8个指示灯同时亮、灭循环（间隔0.2秒）
		led_3();//8个LED依次点亮 先左移 后右移（间隔1秒）
		led_3_mov();//单一灯（LED）的左移、右移（间隔1秒）
		led_4();//8个指示灯从两边倒中间依次点亮（间隔0.2秒）
		led_5();//8个指示灯从中间倒两边中间依次点亮（间隔1秒）
	}
}
///////////////////////////////////////////////////
//函数名称:void led_1
//函数功能:2个指示灯同时亮、灭循环（间隔0.2秒）
//入口参数:无
//出口参数:无
//函数说明:
///////////////////////////////////////////////////
void led_1(void)
{
	L7 = 0;
	L8 = 0;
	delay02s();
	L7 = 1;
	L8 = 1;
	delay02s();
}

///////////////////////////////////////////////////
//函数名称:void led_2
//函数功能:8个指示灯同时亮、灭循环（间隔0.2秒）
//入口参数:无
//出口参数:无
//函数说明:
///////////////////////////////////////////////////
void led_2(void)
{
	L1 = 0;
	L2 = 0;
	L3 = 0;
	L4 = 0;
	L5 = 0;
	L6 = 0;
	L7 = 0;
	L8 = 0;
	delay02s();
	L1 = 1;
	L2 = 1;
	L3 = 1;
	L4 = 1;
	L5 = 1;
	L6 = 1;
	L7 = 1;
	L8 = 1;
	delay02s();
}

///////////////////////////////////////////////////
//函数名称:void led_3
//函数功能:8个LED的从左到右、从右到左依次点亮（间隔1秒）
//入口参数:无
//出口参数:无
//函数说明:
///////////////////////////////////////////////////
void led_3(void)
{
	//////从右向左移///////
	//////////亮///////////
	L1 = 0;
	delay1s();	//延时1秒//
	L2=0; 			//第2个指示灯亮//
    delay1s();	//延时1秒//
    L3=0; 			//第3个指示灯亮//
    delay1s();	//延时1秒//
    L4=0; 			//第4个指示灯亮//
    delay1s();	//延时0.2秒//
	L5=0; 			//第5个指示灯亮//
	delay1s();	//延时0.2秒//
	L6=0; 			//第6个指示灯亮//
	delay1s();	//延时0.2秒//
	L7=0; 			//第7个指示灯亮//
	delay1s();	//延时0.2秒//
	L8=0; 			//第8个指示灯亮//
	delay1s();	//延时0.2秒//
		///////////////灭///////////////////
		 L1=1; 			//第1个指示灯灭//
         delay1s();	//延时0.2秒//
		 L2=1; 			//第2个指示灯灭//
         delay1s();	//延时0.2秒//
		 L3=1; 			//第3个指示灯灭//
         delay1s();	//延时0.2秒//
		 L4=1; 			//第4个指示灯灭//
         delay1s();	//延时0.2秒//
		 L5=1; 			//第5个指示灯灭//
         delay1s();	//延时0.2秒//
		 L6=1; 			//第6个指示灯灭//
         delay1s();	//延时0.2秒//
		 L7=1; 			//第7个指示灯灭//
         delay1s();	//延时0.2秒//
		 L8=1; 			//第8个指示灯灭//
         delay1s();	//延时0.2秒//
		 
	//////从左到右///////
	//////////亮///////////
	L8 = 0;
	delay1s();	//延时1秒//
	L7=0; 			//第2个指示灯亮//
    delay1s();	//延时1秒//
    L6=0; 			//第3个指示灯亮//
    delay1s();	//延时1秒//
    L5=0; 			//第4个指示灯亮//
    delay1s();	//延时0.2秒//
	L4=0; 			//第5个指示灯亮//
	delay1s();	//延时0.2秒//
	L3=0; 			//第6个指示灯亮//
	delay1s();	//延时0.2秒//
	L2=0; 			//第7个指示灯亮//
	delay1s();	//延时0.2秒//
	L1=0; 			//第8个指示灯亮//
	delay1s();	//延时0.2秒//
		///////////////灭///////////////////
		 L1=1; 			//第1个指示灯灭//
         delay1s();	//延时0.2秒//
		 L2=1; 			//第2个指示灯灭//
         delay1s();	//延时0.2秒//
		 L3=1; 			//第3个指示灯灭//
         delay1s();	//延时0.2秒//
		 L4=1; 			//第4个指示灯灭//
         delay1s();	//延时0.2秒//
		 L5=1; 			//第5个指示灯灭//
         delay1s();	//延时0.2秒//
		 L6=1; 			//第6个指示灯灭//
         delay1s();	//延时0.2秒//
		 L7=1; 			//第7个指示灯灭//
         delay1s();	//延时0.2秒//
		 L8=1; 			//第8个指示灯灭//
         delay1s();	//延时0.2秒//	
}




///////////////////////////////////////////////////
//函数名称:void led_3mov
//函数功能8个LED 单一灯（LED）的左移、右移（间隔1秒）
//入口参数:无
//出口参数:无
//函数说明:
///////////////////////////////////////////////////
void led_3_mov(void)		//每个LED(移动)//		 
{ 	
///左移/////
	L1 = 0;
	delay1s();
	L1 = 1;
	L2 = 0;
	delay1s();
	L2 = 1;
	L3 = 0;
	delay1s();
	L3 = 1;
	L4 = 0;
	delay1s();
	L4 = 1;
	L5 = 0;
	delay1s();
	L5 = 1;
	L6 = 0;
	delay1s();
	L6 = 1;
	L7 = 0;
	delay1s();
	L7 = 1;
	L8 = 0;
	delay1s();
	L8 = 1;
	L7 = 0;
////右移////
	delay1s();
	L7 = 1;
	L6 = 0;
	delay1s();
	L6 = 1;
	L5 = 0;
	delay1s();
	L5 = 1;
	L4 = 0;
	delay1s();
	L4 = 1;
	L3 = 0;
	delay1s();
	L3 = 1;
	L2 = 0;
	delay1s();
	L2 = 1;
	L1 = 0;
	delay1s();
	L1 = 1;
	delay1s();
} 



///////////////////////////////////////////////////
//函数名称:void led_4
//函数功能：8个指示灯从两边倒中间依次点亮（间隔1秒）
//入口参数:无
//出口参数:无
//函数说明:
///////////////////////////////////////////////////
void led_4(void)
{
	L8 = 0;
	L1 = 0;
	delay1s();
	L7 = 0;
	L2 = 0;

	delay1s();
	L6 = 0;
	L3 = 0;

	delay1s();

	L5 = 0;
	L4 = 0;
	delay1s();
	
	L1 = 1;
	L2 = 1;
	L3 = 1;
	L4 = 1;
	L5 = 1;
	L6 = 1;
	L7 = 1;
	L8 = 1;
	delay1s();
}

///////////////////////////////////////////////////
//函数名称:void led_5
//函数功能：8个指示灯从中间倒两边中间依次点亮（间隔1秒）
//入口参数:无
//出口参数:无
//函数说明:
///////////////////////////////////////////////////
void led_5(void)
{
	L5 = 0;
	L4 = 0;
	delay1s();
	L6 = 0;
	L3 = 0;
	delay1s();
	L7 = 0;
	L2 = 0;
	delay1s();	
	L8 = 0;
	L1 = 0;
	delay1s();
	L1 = 1;
	L2 = 1;
	L3 = 1;
	L4 = 1;
	L5 = 1;
	L6 = 1;
	L7 = 1;
	L8 = 1;
	delay1s();	
}



///////////////////////////////////////////////////
//函数名称:void delay02s(void)
//函数功能:延时0.2秒的子程序
//入口参数:
//出口参数:
//函数说明:12Mhz 一次2毫秒
///////////////////////////////////////////////////
void delay02s(void)		//延时0.2秒的子程序（20*20*250*2）0.2s//
{ 		
		unsigned char i,j,k; /////局部变量定义
  		for(i=20;i>0;i--)   //最外层循环
			{
		    	for(j=20;j>0;j--)   // 上层循环
					{
				  		for(k=248;k>0;k--) ////内层循环
							{
							;
							}
					}
			}
}

///////////////////////////////////////////////////
//函数名称:void delay1s(void)
//函数功能:延时1秒的子程序
//入口参数:
//出口参数:
//函数说明:12Mhz 一次2毫秒
///////////////////////////////////////////////////
void delay1s(void)		//延时0.2秒的子程序（20*20*250*2）0.2s//
{ 		
		unsigned char i,j,k; /////局部变量定义
  		for(i=100;i>0;i--)   //最外层循环
			{
		    	for(j=20;j>0;j--)   // 上层循环
					{
				  		for(k=248;k>0;k--) ////内层循环
							{
							;
							}
					}
			}
}

