/////////////////////////////////////////////////////////////////////////////////
//设计项目:模拟开关控制指示灯设计实验                                          //
//设 计 人:畅福善                                                              //
//设计时间:2014.4.27                                                           //
//设计说明:设计一个开关计数器， 实现一个模拟开关连续计数，控制8个LED指示灯显示 //
//         硬件连接条件:1、单片机P0.0~P0.7依次连接第1~8个LED指示灯             //
//                      2、4个模拟开关依次连接到P3.4,P3.5,P3.6,P3.7            //
/////////////////////////////////////////////////////////////////////////////////

#include "STC89C52RC.H" 
////////函数说明////////
void delay02s(void);		//延时2秒子程序//
void delay10ms(void);		//延时10ms的子程序//
void key(void);             //按键函数
void display(void);         //显示函数
void display_seg(void);     //数码管显示函数 
void display_ceshi(void);     //数码管测试函数 
void delay500us(void);     //8个数码管显示延时函数
void display_seg_8(void);     //8个数码管显示函数
void display_seg_letter(void);      //HELLO显示函数
extern void alarm_buzzer(void);	//交流蜂鸣器报警子程序//
void display_ceshi_8(void);     //8个数码管测试函数 
////////变量说明////////

unsigned  char count;/////////按键计数器
unsigned  char SEG_1,SEG_2,SEG_3,SEG_4,SEG_5,SEG_6,SEG_7,SEG_8;///////每个数码管的显示变量
/*******数码管码表*****************/
unsigned	char	code	table[]={0x3f,0x06,0x5b,0x4f,0x66,0x6d,0x7d,0x07,0x7f,0x6f,0x77,0x7c,0x39,0x5e,0x79,0x71,0x40,0x00};
//////////////////////////////////////0,    1,   2,   3,   4,   5,   6,   7,   8,   9,   a,   b,   c,   d,   e,   f,   -
unsigned	char	code	table_letter[]={0x76,0x79,0x38,0x3f};////HELLO编码表
//											H     E    L     o
/*******两个数码管的高低位*****************/						 
unsigned  char shiwei;//10位数据
unsigned  char gewei;//个位数据      
/*****4*4键盘所用变量*****************/
unsigned  char temp_i;//分析按键临时变量 
unsigned  char seg_key;//数码管临时按键显示变量 
////////SFR定义///////
//led定义
sbit L1=P0^0;//////定义第1个指示灯的名称为L1  还可以直接采用P0_0;因为AT89X51.H内部已做定义,下依次类推
sbit L2=P0^1;//////定义第2个指示灯的名称为L2 
sbit L3=P0^2;//////定义第3个指示灯的名称为L3  
sbit L4=P0^3;//////定义第4个指示灯的名称为L4 
sbit L5=P0^4;//////定义第5个指示灯的名称为L5  
sbit L6=P0^5;//////定义第6个指示灯的名称为L6 
sbit L7=P0^6;//////定义第7个指示灯的名称为L7  
sbit L8=P0^7;//////定义第8个指示灯的名称为L8 

//按键定义
sbit key_1=P3^4;//////定义第1个按键为KEY_1
sbit key_2=P3^5;//////定义第1个按键为KEY_2
sbit key_3=P3^6;//////定义第1个按键为KEY_3
sbit key_4=P3^7;//////定义第1个按键为KEY_4
//蜂鸣器定义
sbit FMQ=P3^2;//////定义蜂鸣器为P14控制

void main(void) 			//主程序//
{   
P3=0xff;/////初始化P3口准备读取按键（按键输入）
display_ceshi();///数码管自检
count=5;//初始值预置

	while(1) 			    //进入循环//以下为无限循环程序区
     	{ 
		 key(); 			//调用按键函数//
		 display_seg();     //调用数码管显示函数 

				//////////////显示数据处理程序/////////////////////////////
				SEG_5=count/1000;//得到千位数据
				SEG_6=(count%1000)/100;//得到百位数据100
				SEG_7=((count%1000)%100)/10;//得到十位数据
				SEG_8=((count%1000)%100)%10;//得到个位数据
        } 
}
///////////////////////////////////////////////////
//函数名称:void key(void)
//函数功能:按键函数
//入口参数:
//出口参数:
//函数说明:
///////////////////////////////////////////////////
void key(void)      //按键函数
{
///////////////////key_1按键////////////////////////////////
	if(key_1==0)/////////如果按键按下
	{
	  delay10ms();///////延时10ms///越过抖动区7ms
	  if(key_1==0)///////按键的确按下
	    {
//		alarm_buzzer();/////按键音
//count=0;///////按键计数器计数
		count++;///////按键计数器计数
		//if(count>=16){count=0;}//////控制计数器最大值;16即为16进制;20即为20进制;但最大计数255，因为count定义的是unsigend char
		while(key_1==0){;}///////按键等待抬起

		}
	}
///////////////////key_2按键////////////////////////////////
	if(key_2==0)/////////如果按键按下
	{
	  delay10ms();///////延时10ms///越过抖动区7ms
	  if(key_2==0)///////按键的确按下
	    {
//		alarm_buzzer();/////按键音
		count++;///////按键计数器计数
		if(count>=20){count=20;}//////控制计数器最大值;16即为16进制;20即为20进制;但最大计数255，因为count定义的是unsigend char
		while(key_2==0){;}///////按键等待抬起
		}
	}
///////////////////key_2按键////////////////////////////////
	if(key_3==0)/////////如果按键按下
	{
	  delay10ms();///////延时10ms///越过抖动区7ms
	  if(key_3==0)///////按键的确按下
	    {
//		alarm_buzzer();/////按键音
		count--;///////按键计数器计数
		if(count>=255){count=0;}//////控制计数器最大值;16即为16进制;20即为20进制;但最大计数255，因为count定义的是unsigend char
		while(key_3==0){;}///////按键等待抬起
		}
	}



}



///////////////////////////////////////////////////
//函数名称:void display_seg(void)
//函数功能:动态数码管显示函数
//入口参数:
//出口参数:
//函数说明:
///////////////////////////////////////////////////
void display_seg(void)      //数码管显示函数
{
//count=17;
//////////////显示数据处理程序/////////////////////////////
shiwei=count/10;//得到10位数据
gewei=count%10;//得到个位数据


/////////十位显示//////////////////////
P0=table[shiwei];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存//////clk信号
P0=~0x40;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
	//delay10ms();///延时10ms
    delay500us();
/////////黑屏显示//////////////////////
P0=table[17];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存//////clk信号
P0=~0x00;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
	//delay10ms();///延时10ms
    //delay500us();
/////////个位显示//////////////////////
P0=table[gewei];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存
P0=~0x80;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
	//delay10ms();///延时10ms
    delay500us();
/////////黑屏显示//////////////////////
P0=table[17];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存//////clk信号
P0=~0x00;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
	//delay10ms();///延时10ms
    //delay500us();

}

///////////////////////////////////////////////////
//函数名称:void display_seg_8(void)
//函数功能:8个数码管显示函数
//入口参数:
//出口参数:
//函数说明:
///////////////////////////////////////////////////
void display_seg_8(void)      //8个数码管显示函数
{
//count=123;
//SEG_1=4;
//SEG_2=3;
//SEG_3=8;
//SEG_4=9;
//SEG_5=7;
//SEG_6=2;
//SEG_7=5;
//SEG_8=6;
//////////////显示数据处理程序/////////////////////////////
///*
//SEG_5=count/1000;//得到1000位数据
//SEG_6=(count%1000)/100;//得到个位数据100
//SEG_7=((count%1000)%100)/10;//得到10位数据
//SEG_8=((count%1000)%100)%10;//得到个位数据

//*/
//////////////显示程序/////////////////////////////

/////////1位显示//////////////////////
P0=table[SEG_1];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存
P0=~0x01;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
     delay500us();///延时500us

/////////黑屏显示//////////////////////
P0=table[17];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存//////clk信号
P0=~0x00;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
	//delay10ms();///延时10ms
    //delay500us();

/////////2位显示//////////////////////
P0=table[SEG_2];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存
P0=~0x02;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
     delay500us();///延时500us
/////////黑屏显示//////////////////////
P0=table[17];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存//////clk信号
P0=~0x00;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
	//delay10ms();///延时10ms
    //delay500us();

/////////3位显示//////////////////////
P0=table[SEG_3];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存
P0=~0x04;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
     delay500us();///延时500us
/////////黑屏显示//////////////////////
P0=table[17];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存//////clk信号
P0=~0x00;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
	//delay10ms();///延时10ms
    //delay500us();
/////////4位显示//////////////////////
P0=table[SEG_4];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存
P0=~0x08;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
     delay500us();///延时500us
/////////黑屏显示//////////////////////
P0=table[17];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存//////clk信号
P0=~0x00;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
	//delay10ms();///延时10ms
    //delay500us();
/////////5位显示//////////////////////
P0=table[SEG_5];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存
P0=~0x10;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
     delay500us();///延时500us
/////////黑屏显示//////////////////////
P0=table[17];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存//////clk信号
P0=~0x00;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
	//delay10ms();///延时10ms
    //delay500us();
/////////6位显示//////////////////////
P0=table[SEG_6];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存
P0=~0x20;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
     delay500us();///延时500us
/////////黑屏显示//////////////////////
P0=table[17];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存//////clk信号
P0=~0x00;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
	//delay10ms();///延时10ms
    //delay500us();
/////////7位显示//////////////////////
P0=table[SEG_7];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存
P0=~0x40;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
     delay500us();///延时500us
/////////黑屏显示//////////////////////
P0=table[17];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存//////clk信号
P0=~0x00;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
	//delay10ms();///延时10ms
    //delay500us();
/////////8位显示//////////////////////
P0=table[SEG_8];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存
P0=~0x80;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
     delay500us();///延时500us
/////////黑屏显示//////////////////////
P0=table[17];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存//////clk信号
P0=~0x00;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
	//delay10ms();///延时10ms
    //delay500us();


}

//////////////////////////////////////////////////
//函数名称:void display_seg_letter(void)
//函数功能:HELLO显示函数
//入口参数:
//出口参数:
//函数说明:
///////////////////////////////////////////////////
void display_seg_letter(void)      //HELLO显示函数
{

//////////////显示数据处理程序/////////////////////////////
///*
SEG_1=0;//得到H的字符表位置数据
SEG_2=1;//得到E的字符表位置数据
SEG_3=2;//得到L的字符表位置数据
SEG_4=2;//得到L的字符表位置数据
SEG_5=3;//得到O的字符表位置数据

SEG_6=16;//得到O的字符表位置数据
//SEG_5=count/1000;//得到1000位数据
//SEG_6=(count%1000)/100;//得到个位数据100
SEG_7=((count%1000)%100)/10;//得到10位数据
SEG_8=((count%1000)%100)%10;//得到个位数据

//*/
//////////////显示程序/////////////////////////////

/////////1位显示//////////////////////
P0=table_letter[SEG_1];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存


P0=~0x01;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
     delay500us();///延时500us
/////////黑屏显示//////////////////////
P0=table[17];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存//////clk信号
P0=~0x00;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
	//delay10ms();///延时10ms
    //delay500us();
/////////2位显示//////////////////////
P0=table_letter[SEG_2];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存
P0=~0x02;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
     delay500us();///延时500us
/////////黑屏显示//////////////////////
P0=table[17];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存//////clk信号
P0=~0x00;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
	//delay10ms();///延时10ms
    //delay500us();
/////////3位显示//////////////////////
P0=table_letter[SEG_3];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存
P0=~0x04;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
     delay500us();///延时500us
/////////黑屏显示//////////////////////
P0=table[17];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存//////clk信号
P0=~0x00;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
	//delay10ms();///延时10ms
    //delay500us();
/////////4位显示//////////////////////
P0=table_letter[SEG_4];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存
P0=~0x08;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
     delay500us();///延时500us
/////////黑屏显示//////////////////////
P0=table[17];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存//////clk信号
P0=~0x00;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
	//delay10ms();///延时10ms
    //delay500us();
/////////5位显示//////////////////////
P0=table_letter[SEG_5];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存
P0=~0x10;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
     delay500us();///延时500us
/////////黑屏显示//////////////////////
P0=table[17];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存//////clk信号
P0=~0x00;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
	//delay10ms();///延时10ms
    //delay500us();
/////////6位显示//////////////////////
P0=table[SEG_6];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存
P0=~0x20;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
     delay500us();///延时500us
/////////黑屏显示//////////////////////
P0=table[17];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存//////clk信号
P0=~0x00;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
	//delay10ms();///延时10ms
    //delay500us();
/////////7位显示//////////////////////
P0=table[SEG_7];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存
P0=~0x40;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
     delay500us();///延时500us
/////////黑屏显示//////////////////////
P0=table[17];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存//////clk信号
P0=~0x00;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
	//delay10ms();///延时10ms
    //delay500us();
/////////8位显示//////////////////////
P0=table[SEG_8];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存
P0=~0x80;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
     delay500us();///延时500us
/////////黑屏显示//////////////////////
P0=table[17];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存//////clk信号
P0=~0x00;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
	//delay10ms();///延时10ms
    //delay500us();
}

///////////////////////////////////////////////////
//函数名称:void delay10ms(void)
//函数功能:延时10ms秒的子程序
//入口参数:
//出口参数:
//函数说明:
///////////////////////////////////////////////////
void delay10ms(void)		//延时10ms的子程序//
{ 		
//		unsigned char i,j,k; /////局部变量定义
		unsigned char j,k; /////局部变量定义
//  		for(i=20;i>0;i--)   //最外层循环
//			{
		    	for(j=20;j>0;j--)   // 上层循环
					{
				  		for(k=248;k>0;k--) ////内层循环
							{
							;
							}
					}
//			}
}  
///////////////////////////////////////////////////
//函数名称:void delay02s(void)
//函数功能:延时0.2秒的子程序
//入口参数:
//出口参数:
//函数说明:
///////////////////////////////////////////////////
void delay02s(void)		//延时子程序//
{ 		
		unsigned char i,j,k; /////局部变量定义
  		for(i=20;i>0;i--)   //最外层循环
			{
		    	for(j=20;j>0;j--)   // 上层循环
					{
				  		for(k=248;k>0;k--) ////内层循环
							{
							;
							}
					}
			}
}
///////////////////////////////////////////////////
//函数名称:void delay200us(void)
//函数功能:延时10ms秒的子程序
//入口参数:
//出口参数:
//函数说明:
///////////////////////////////////////////////////
void delay500us(void)		//延时10ms的子程序//
{ 		
//		unsigned char i,j,k; /////局部变量定义
		unsigned char k; /////局部变量定义
//  		for(i=20;i>0;i--)   //最外层循环
//			{
//		    	for(j=20;j>0;j--)   // 上层循环
//					{
				  		for(k=248;k>0;k--) ////内层循环
							{
							;
							}
//					}
//			}
} 
///////////////////////////////////////////////////
//函数名称:void display_ceshi(void)
//函数功能:数码管测试函数
//入口参数:
//出口参数:
//函数说明:
///////////////////////////////////////////////////
void display_ceshi(void)     //数码管测试函数 
{
	unsigned char i;
	unsigned int j;
	count=110;
	  for(i=0;i<10;i++)
	   {
	   count=count-11;
		  for(j=0;j<800;j++)
		   {
		   display_seg();
		   }
		}
}
///////////////////////////////////////////////////
//函数名称:void display_ceshi_8(void)
//函数功能:8个数码管测试函数
//入口参数:
//出口参数:
//函数说明:
///////////////////////////////////////////////////
void display_ceshi_8(void)     //8个数码管测试函数 
{
	unsigned char i,k;
	unsigned char j=10;
for(k=0;k<10;k++)
{
j=j-1;

	  for(i=0;i<50;i++)
	   {

		SEG_1=j;SEG_2=j;SEG_3=j;SEG_4=j;SEG_5=j;SEG_6=j;SEG_7=j;SEG_8=j;

		display_seg_8();     //8个调用数码管显示函数

		}
}

}