////////////////////////////////////////////////////////////////////////////////////////
//设计项目:设计一个基于单片机的智能电子表                                             //
//设 计 人:畅福善                                                                     //
//设计时间:2016.5.30                                                                  //
//设计说明:设计一个智能电子表， 利用中断实现智能电子钟的自动走时设计，并在8个数码管上 //
//		   分别显示走时过程(XX-XX-XX)，即XX时、XX分、XX秒中间采用"-"分开；            //
//         利用四个独立按键完成时、分、秒的初始化设置                       //
//         硬件连接条件:1、单片机P0.0~P0.7依次连接第1~8个LED指示灯                    //
//                      2、4个模拟开关依次连接到P3.4,P3.5,P3.6,P3.7                   //
//                      3、数码管数据连接IC7 锁存控制P2.6                             //
//                      4、数码管数据连接IC6 锁存控制P2.7                             //
////////////////////////////////////////////////////////////////////////////////////////

//#include <AT89X51.H> 
//#include "STC89C52RC.H" 
#include "STC15F2K60S2.H" 
////////函数说明////////
void delay02s(void);		//延时2秒子程序//
void delay10ms(void);		//延时10ms的子程序//
void delay500us(void);		//延时500us的子程序//
void delay50us(void);		//延时50us的子程序//
void baojing(void); 
void int_time0(void);       //t0定时器初始化函数 
void int_time1(void);       //t1定时器初始化函数  
void key_set(void);      //设置按键函数
void display_seg_set_hours_min_s(void);//数码管小时设置显示函数
void display_seg_HC6800(void);      //显示函数
////////初始化函数////////
void alarm_buzzer(void );/////交流蜂鸣器自检
void SEG_init(void);      //数码管初始化函数
void LED_init(void);      //LED初始化函数
void key_init(void);      //按键初始化函数
void fmq_ceshi(void);	  //蜂鸣器自检
////////变量说明////////
//led定义
sbit L1=P1^0;//////定义第1个指示灯的名称为L1  还可以直接采用P0_0;因为AT89X51.H内部已做定义,下依次类推
sbit L2=P1^1;//////定义第2个指示灯的名称为L2 
sbit L3=P1^2;//////定义第3个指示灯的名称为L3  
sbit L4=P1^3;//////定义第4个指示灯的名称为L4 
sbit L5=P1^4;//////定义第5个指示灯的名称为L5  
sbit L6=P1^5;//////定义第6个指示灯的名称为L6 
sbit L7=P1^6;//////定义第7个指示灯的名称为L7  
sbit L8=P1^7;//////定义第8个指示灯的名称为L8 
//按键定义
sbit key_1=P3^4;//////定义第1个按键为KEY_1
sbit key_2=P3^5;//////定义第1个按键为KEY_2
sbit key_3=P4^2;//////定义第1个按键为KEY_3
sbit key_4=P4^4;//////定义第1个按键为KEY_4
//锁存器定义
sbit duan_clc=P2^6;//////定义段锁存器(IC7)时钟脉冲
sbit wen_clc=P2^7;//////定义位锁存器(IC6)时钟脉冲
//蜂鸣器定义
sbit FMQ=P3^2;//////定义fmq蜂鸣器单片机驱动口

/////////////////////////////
unsigned  char count;/////////按键计数器

unsigned  char code table[]={0x3f,0x06,0x5b,0x4f,0x66,0x6d,0x7d,0x07,0x7f,0x6f,0x77,0x7c,0x39,0x5e,0x79,0x71,0x40,0x00};////数码管显示码表
//////////////////////////////0     1    2    3    4    5    6    7    8    9	A    B     C    D    E    F	  				 
unsigned  char shiwei;//10位数据
unsigned  char gewei;//个位数据                            	
unsigned  char SEG_1,SEG_2,SEG_3,SEG_4,SEG_5,SEG_6,SEG_7,SEG_8;//////8个数码管对应显示单元定义
bit flag_baojing;///////定义报警标志

unsigned char jsq_50ms,jsq_1s;///////50ms计数器和1S计数器
unsigned char jsq_1min,jsq_1hours;///////1分计数器和1小时计数器
///////////////一键多功能计数器的设置//////////////
unsigned char jsq_function;///////功能计数器
unsigned char jsq_set_xianshi;///////设置显示计数器
//////////////闹铃时间设置//////////////
unsigned char jsq_naoling_1hours=1,jsq_naoling_1min,jsq_naoling_1s=1;///////闹铃时间


void main(void) 			//主程序//
	{   
	/////////初始化区////////////////
	key_init();////////按键初始化
    fmq_ceshi();//交流蜂鸣器初始化、自检 
	LED_init();////////指示灯初始化、自检
	SEG_init();////////数码管初始化、自检
	int_time0();/////初始化t0定时器
	int_time1();/////初始化t1定时器
	while(1) 			    //进入循环//以下为无限循环程序区
     	{
//TR0=0;TR1=0; 
////////////////利用中断实验时间与数码管的关系,其中采用中断函数计数//////////////////////////////////////
		key_set();///按键设置函数
		//display_seg_HC6800();      //显示函数
		display_seg_set_hours_min_s();  //调用电子表设置显示函数
		//if(jsq_naoling_1hours==jsq_1hours&&jsq_naoling_1min==jsq_1min&&jsq_naoling_1s==jsq_1s){
		//TR1=1;}
		//if(jsq_naoling_1hours==jsq_1hours&&jsq_naoling_1min==jsq_1min&&jsq_naoling_1s+5==jsq_1s){
		//TR1=0;}
        } 
}
	
void baojing(void)
{
unsigned  int baojing_i;
		  for(baojing_i=100;baojing_i>0;baojing_i--)
		   {
		    P14=~P14;               //P1_0取反//
			delay500us();            //延时500us//
		   }
}


void fmq_ceshi()
{	
//////////蜂鸣器初始化////////////////////
	FMQ=0;
	delay02s();delay02s();delay02s();delay02s();delay02s();///声音延长时间
	FMQ=1;
}
///////////////////////////////////////////////////
//函数名称:void key_set(void)
//函数功能:设置按键函数
//入口参数:
//出口参数:
//函数说明:
///////////////////////////////////////////////////
void key_set(void)      //设置按键函数
{

///////////1键多功能/////////////////////////
	if(key_1==0)/////////如果按键按下
	{
	  delay10ms();///////延时10ms
	  if(key_1==0)///////按键的确按下
	    {
		TR0=0;
		jsq_function++;///////按键计数器计数
		if(jsq_function>=7){jsq_function=0;}//////控制计数器最大值;16即为16进制;20即为20进制;但最大计数255，因为count定义的是unsigend char
		//while(key_1==0){display_seg_set_hours_min_s();}///////按键等待抬起
		while(key_1==0){display_seg_set_hours_min_s();}///////按键等待抬起
		}
	}

///////////功能1/////////////////////////
	if(jsq_function==1)
	{
		if(key_2==0)/////////如果按键按下
		{
		  delay10ms();///////延时10ms
		  if(key_2==0)///////按键的确按下
		    {
			TR0=0;
			jsq_1hours++;
			if(jsq_1hours==24){jsq_1hours=23;}//////控制小时计数器最大值
			while(key_2==0){display_seg_set_hours_min_s();}///////按键等待抬起
			}
		}
		if(key_3==0)/////////如果按键按下
		{
		  delay10ms();///////延时10ms
		  if(key_3==0)///////按键的确按下
		    {
			TR0=0;
			jsq_1hours--;
			if(jsq_1hours==255){jsq_1hours=0;}//////控制小时计数器最大值
			while(key_3==0){display_seg_set_hours_min_s();}///////按键等待抬起
			}
		}
	}
///////////功能2/////////////////////////
	if(jsq_function==2)
	{
		if(key_2==0)/////////如果按键按下
		{
		  delay10ms();///////延时10ms
		  if(key_2==0)///////按键的确按下
		    {
			TR0=0;
			jsq_1min++;
			if(jsq_1min==60){jsq_1min=59;}//////控制小时计数器最大值
			while(key_2==0){display_seg_set_hours_min_s();}///////按键等待抬起
			}
		}
		if(key_3==0)/////////如果按键按下
		{
		  delay10ms();///////延时10ms
		  if(key_3==0)///////按键的确按下
		    {
			TR0=0;
			jsq_1min--;
			if(jsq_1min==255){jsq_1min=0;}//////控制小时计数器最大值
			while(key_3==0){display_seg_set_hours_min_s();}///////按键等待抬起
			}
		}
	}
///////////功能3/////////////////////////
	if(jsq_function==3)
	{
		if(key_2==0)/////////如果按键按下
		{
		  delay10ms();///////延时10ms
		  if(key_2==0)///////按键的确按下
		    {
			TR0=0;
			jsq_1s++;
			if(jsq_1s==60){jsq_1s=59;}//////控制小时计数器最大值
			while(key_2==0){display_seg_set_hours_min_s();}///////按键等待抬起
			}
		}
		if(key_3==0)/////////如果按键按下
		{
		  delay10ms();///////延时10ms
		  if(key_3==0)///////按键的确按下
		    {
			TR0=0;
			jsq_1s--;
			if(jsq_1s==255){jsq_1s=0;}//////控制小时计数器最大值
			while(key_3==0){display_seg_set_hours_min_s();}///////按键等待抬起
			}
		}
    }
///////////功能4//闹铃设置///////////////////////
	if(jsq_function==4)
	{
		if(key_2==0)/////////如果按键按下
		{
		  delay10ms();///////延时10ms
		  if(key_2==0)///////按键的确按下
		    {
			TR0=0;
			jsq_naoling_1hours++;
			if(jsq_naoling_1hours==24){jsq_naoling_1hours=23;}//////控制小时计数器最大值
			while(key_2==0){display_seg_set_hours_min_s();}///////按键等待抬起
			}
		}
		if(key_3==0)/////////如果按键按下
		{
		  delay10ms();///////延时10ms
		  if(key_3==0)///////按键的确按下
		    {
			TR0=0;
			jsq_naoling_1hours--;
			if(jsq_naoling_1hours==255){jsq_naoling_1hours=0;}//////控制小时计数器最大值
			while(key_3==0){display_seg_set_hours_min_s();}///////按键等待抬起
			}
		}
	}
///////////功能5/////////////////////////
	if(jsq_function==5)
	{
		if(key_2==0)/////////如果按键按下
		{
		  delay10ms();///////延时10ms
		  if(key_2==0)///////按键的确按下
		    {
			TR0=0;
			jsq_naoling_1min++;
			if(jsq_naoling_1min==60){jsq_naoling_1min=59;}//////控制小时计数器最大值
			while(key_2==0){display_seg_set_hours_min_s();}///////按键等待抬起
			}
		}
		if(key_3==0)/////////如果按键按下
		{
		  delay10ms();///////延时10ms
		  if(key_3==0)///////按键的确按下
		    {
			TR0=0;
			jsq_naoling_1min--;
			if(jsq_naoling_1min==255){jsq_naoling_1min=0;}//////控制小时计数器最大值
			while(key_3==0){display_seg_set_hours_min_s();}///////按键等待抬起
			}
		}
	}
///////////功能3/////////////////////////
	if(jsq_function==6)
	{
		if(key_2==0)/////////如果按键按下
		{
		  delay10ms();///////延时10ms
		  if(key_2==0)///////按键的确按下
		    {
			TR0=0;
			jsq_naoling_1s++;
			if(jsq_naoling_1s==60){jsq_naoling_1s=59;}//////控制小时计数器最大值
			while(key_2==0){display_seg_set_hours_min_s();}///////按键等待抬起
			}
		}
		if(key_3==0)/////////如果按键按下
		{
		  delay10ms();///////延时10ms
		  if(key_3==0)///////按键的确按下
		    {
			TR0=0;
			jsq_naoling_1s--;
			if(jsq_naoling_1s==255){jsq_naoling_1s=0;}//////控制小时计数器最大值
			while(key_3==0){display_seg_set_hours_min_s();}///////按键等待抬起
			}
		}
    }
	
	//定时报警//
	if(flag_baojing==0&&(jsq_naoling_1hours==jsq_1hours)&&(jsq_naoling_1min==jsq_1min)&&((jsq_1s>=jsq_naoling_1s)&&(jsq_1s<=jsq_naoling_1s+5)))
		{
		FMQ=0;P14=0;
		}
      else{FMQ=1;P14=1;}

///////////功能结束开表运行/////////////////////////

	if(key_4==0)/////////如果按键按下
	{
	  delay10ms();///////延时10ms
	  if(key_4==0)///////按键的确按下
	    {
		TR0=1;///////开表0
		TR1=0;///////停表1
		jsq_function=0;////功能计数器清0
		while(key_4==0){display_seg_set_hours_min_s();}///////按键等待抬起
		}
	}

}



///////////////////////////////////////////////////
//函数名称:void delay500us(void)
//函数功能:延时500us秒的子程序
//入口参数:
//出口参数:
//函数说明:
///////////////////////////////////////////////////
void delay500us(void)		//延时10ms的子程序//
  { 		
	unsigned char k; /////局部变量定义
	for(k=248;k>0;k--) ////内层循环
		{
		;
		}
  }  
///////////////////////////////////////////////////
//函数名称:void delay10ms(void)
//函数功能:延时10ms秒的子程序
//入口参数:
//出口参数:
//函数说明:
///////////////////////////////////////////////////
void delay10ms(void)		//延时10ms的子程序//
  { 		
	unsigned char j,k; /////局部变量定义
	for(j=20;j>0;j--)   // 上层循环
		{
		for(k=248;k>0;k--) ////内层循环
			{
			;
			}
		}
  } 
 
///////////////////////////////////////////////////
//函数名称:void delay02s(void)
//函数功能:延时0.2秒的子程序
//入口参数:
//出口参数:
//函数说明:
///////////////////////////////////////////////////
void delay02s(void)		//延时子程序//
{ 		
	unsigned char i,j,k; /////局部变量定义
  	for(i=20;i>0;i--)   //最外层循环
		{
		   for(j=20;j>0;j--)   // 上层循环
			{
			for(k=248;k>0;k--) ////内层循环
			 {
			 ;
			 }
			}
		}
} 
///////////////////////////////////////////////////
//函数名称:void int_time0(void)
//函数功能:定时器t0初始化
//入口参数:
//出口参数:
//函数说明:
///////////////////////////////////////////////////
void int_time0(void) 
{
	//设置定时器0工作方式//
	TMOD=0x01;								//定义为定时器0方式1,SFR中TMOD位于不能被8整除的地址,所以要按字节方式赋值//
	//赋值方法1//
	TH0=(65536-50000)/256;					//赋初值//
	TL0=(65536-50000)%256;
	//赋值方法2//
//	TH0=(65536-100)>>8;					//赋初值//
//	TL0=(65536-100);
	//打开中断通道//
	ET0=1;									//开启定时器0溢出中断//
	EA=1;									//开启总的中断开关//

///////50ms计数器和1S计数器初始内容清零///////
jsq_50ms=0;
jsq_1s=0;
///////显示秒计数器内容准备///////

	SEG_7=jsq_1s/10;							//显示秒数的十位//
	SEG_8=jsq_1s%10;							//显示秒数的个位//

///////开表/////
	TR0=1;									//开启定时器0//
}

///////////////////////////////////////////////////
//函数名称:void	interrupt_t0(void)	interrupt	1
//函数功能:t0中断函数
//入口参数:
//出口参数:
//函数说明:
///////////////////////////////////////////////////
void	interrupt_t0(void)	interrupt	1		//定时器0溢出中断//
{
////////////赋初值//////////////////////////////////
	//赋初值方法1//
	TH0=(65536-50000)/256;					//赋初值//
	TL0=(65536-50000)%256;
	//赋初值方法2//
//	TH0=(65536-100)>>8;					//赋初值//
//	TL0=(65536-100);
	jsq_50ms++;											//每到一个中断为50毫秒,jsq_50ms加1//
///////50ms满20次=1秒//////
	if(jsq_50ms==20)									//到来20次中断后,jsq_50ms重新计数//
		{	
		jsq_50ms=0;
		jsq_1s++;										//每来20次中断即为1秒,jsq_1s加1//
///////1s满60次=1分//////
		if(jsq_1s==60)									//每到60秒,则重新计时//
			{	
			jsq_1s=0;
			jsq_1min++;
///////1分满60次=1小时//////
			if(jsq_1min==60)									//每到60分,则重新计时//
				{
				jsq_1min=0;
				jsq_1hours++;
///////1小时满24次清零//////
				if(jsq_1hours==24)									//每到24小时,则重新计时//
					{
				jsq_1hours=0;
					}
				}
			}
	///////显示秒计数器内容准备///////

		SEG_1=jsq_1hours/10;;
		SEG_2=jsq_1hours%10;
		SEG_3=16;
		SEG_4=jsq_1min/10;
		SEG_5=jsq_1min%10;
		SEG_6=16;
		SEG_7=jsq_1s/10;								//显示秒数的十位//
		SEG_8=jsq_1s%10;	
		}
}
///////////////////////////////////////////////////
//函数名称:void display_seg_set_hours_min_s(void)
//函数功能:数码管时、分、秒显示函数
//入口参数:
//出口参数:
//函数说明:
///////////////////////////////////////////////////
void display_seg_set_hours_min_s(void)      //小时显示函数
{

////////////////////利用计数器不同时间显示不同内容，完成闪烁显示/////////////////
		jsq_set_xianshi++;
////////////////////调表显示/////////////////
if(jsq_function==1||jsq_function==2||jsq_function==3)
{
		SEG_1=jsq_1hours/10;								//显示时的十位//
		SEG_2=jsq_1hours%10;								//显示时的个位//
		SEG_3=16;
		SEG_4=jsq_1min/10;								//显示分的十位//
		SEG_5=jsq_1min%10;								//显示分的个位//
		SEG_6=16;
		SEG_7=jsq_1s/10;								//显示秒数的十位//
		SEG_8=jsq_1s%10;								//显示秒数的个位//
}
////////////////////闹铃显示///////////////	
if(jsq_function==4||jsq_function==5||jsq_function==6)
{
		SEG_1=jsq_naoling_1hours/10;								//显示时的十位//
		SEG_2=jsq_naoling_1hours%10;								//显示时的个位//
		SEG_3=16;
		SEG_4=jsq_naoling_1min/10;								//显示分的十位//
		SEG_5=jsq_naoling_1min%10;								//显示分的个位//
		SEG_6=16;
		SEG_7=jsq_naoling_1s/10;								//显示秒数的十位//
		SEG_8=jsq_naoling_1s%10;								//显示秒数的个位//
}
////////////专用数码管闪烁/////////
		if(jsq_function==1&&jsq_set_xianshi<=100)
			{
			SEG_1=17;SEG_2=17;
			}		
		if(jsq_function==2&&jsq_set_xianshi<=100)
			{
			SEG_4=17;SEG_5=17;
			}
		if(jsq_function==3&&jsq_set_xianshi<=100)
			{
			SEG_7=17;SEG_8=17;
			}
///////////////////////////////////////////////////////////
		if(jsq_function==4&&jsq_set_xianshi<=100)
			{
			SEG_1=17;SEG_2=17;
			}		
		if(jsq_function==5&&jsq_set_xianshi<=100)
			{
			SEG_4=17;SEG_5=17;
			}
		if(jsq_function==6&&jsq_set_xianshi<=100)
			{
			SEG_7=17;SEG_8=17;
			}
		if(jsq_set_xianshi>200){jsq_set_xianshi=0;}
//////////////显示程序/////////////////////////////
/////////1位显示//////////////////////
P0=table[SEG_1];//////数据从P0口送出到IC7---74HC573锁存器
duan_clc=0;duan_clc=1;duan_clc=0;///IC7数据锁存
P0=~0x10;//////位码从P0口送出到IC6---74HC573锁存器
wen_clc=0;wen_clc=1;wen_clc=0;///IC6位码数据锁存
//	delay10ms();///延时0.2s
	delay500us();///延时0.5ms
	///去鬼影//
P0=0XFF;//////数据从P0口送出到IC7---74HC573锁存器
wen_clc=0;wen_clc=1;wen_clc=0;///IC6位码数据锁存

/////////2位显示//////////////////////
P0=table[SEG_2];//////数据从P0口送出到IC7---74HC573锁存器
duan_clc=0;duan_clc=1;duan_clc=0;///IC7数据锁存
P0=~0x20;//////位码从P0口送出到IC6---74HC573锁存器
wen_clc=0;wen_clc=1;wen_clc=0;///IC6位码数据锁存
//	delay10ms();///延时0.2s
	delay500us();///延时0.5ms
	///去鬼影//
P0=0XFF;//////数据从P0口送出到IC7---74HC573锁存器
wen_clc=0;wen_clc=1;wen_clc=0;///IC6位码数据锁存
/////////3位显示//////////////////////
P0=table[SEG_3];//////数据从P0口送出到IC7---74HC573锁存器
duan_clc=0;duan_clc=1;duan_clc=0;///IC7数据锁存
P0=~0x40;//////位码从P0口送出到IC6---74HC573锁存器
wen_clc=0;wen_clc=1;wen_clc=0;///IC6位码数据锁存
//	delay10ms();///延时0.2s
	delay500us();///延时0.5ms
	///去鬼影//
P0=0XFF;//////数据从P0口送出到IC7---74HC573锁存器
wen_clc=0;wen_clc=1;wen_clc=0;///IC6位码数据锁存
/////////4位显示//////////////////////
P0=table[SEG_4];//////数据从P0口送出到IC7---74HC573锁存器
duan_clc=0;duan_clc=1;duan_clc=0;///IC7数据锁存
P0=~0x80;//////位码从P0口送出到IC6---74HC573锁存器
wen_clc=0;wen_clc=1;wen_clc=0;///IC6位码数据锁存
//	delay10ms();///延时0.2s
	delay500us();///延时0.5ms
		///去鬼影//
P0=0XFF;//////数据从P0口送出到IC7---74HC573锁存器
wen_clc=0;wen_clc=1;wen_clc=0;///IC6位码数据锁存

/////////5位显示//////////////////////
P0=table[SEG_5];//////数据从P0口送出到IC7---74HC573锁存器
duan_clc=0;duan_clc=1;duan_clc=0;///IC7数据锁存
P0=~0x01;//////位码从P0口送出到IC6---74HC573锁存器
wen_clc=0;wen_clc=1;wen_clc=0;///IC6位码数据锁存
//	delay10ms();///延时0.2s
	delay500us();///延时0.5ms
	///去鬼影//
P0=0XFF;//////数据从P0口送出到IC7---74HC573锁存器
wen_clc=0;wen_clc=1;wen_clc=0;///IC6位码数据锁存

/////////6位显示//////////////////////
P0=table[SEG_6];//////数据从P0口送出到IC7---74HC573锁存器
duan_clc=0;duan_clc=1;duan_clc=0;///IC7数据锁存
P0=~0x02;//////位码从P0口送出到IC6---74HC573锁存器
wen_clc=0;wen_clc=1;wen_clc=0;///IC6位码数据锁存
//	delay10ms();///延时0.2s
	delay500us();///延时0.5ms
	///去鬼影//
P0=0XFF;//////数据从P0口送出到IC7---74HC573锁存器
wen_clc=0;wen_clc=1;wen_clc=0;///IC6位码数据锁存
/////////7位显示//////////////////////
P0=table[SEG_7];//////数据从P0口送出到IC7---74HC573锁存器
duan_clc=0;duan_clc=1;duan_clc=0;///IC7数据锁存
P0=~0x04;//////位码从P0口送出到IC6---74HC573锁存器
wen_clc=0;wen_clc=1;wen_clc=0;///IC6位码数据锁存
//	delay10ms();///延时0.2s
	delay500us();///延时0.5ms
	///去鬼影//
P0=0XFF;//////数据从P0口送出到IC7---74HC573锁存器
wen_clc=0;wen_clc=1;wen_clc=0;///IC6位码数据锁存
/////////8位显示//////////////////////
P0=table[SEG_8];//////数据从P0口送出到IC7---74HC573锁存器
duan_clc=0;duan_clc=1;duan_clc=0;///IC7数据锁存
P0=~0x08;//////位码从P0口送出到IC6---74HC573锁存器
wen_clc=0;wen_clc=1;wen_clc=0;///IC6位码数据锁存
//	delay10ms();///延时0.2s
	delay500us();///延时0.5ms
		///去鬼影//
P0=0XFF;//////数据从P0口送出到IC7---74HC573锁存器
wen_clc=0;wen_clc=1;wen_clc=0;///IC6位码数据锁存
}
///////////////////////////////////////////////////
//函数名称:void display_seg_HC6800(void)
//函数功能:HC6800开发板的数码管显示函数
//入口参数:
//出口参数:
//函数说明:
///////////////////////////////////////////////////
void display_seg_HC6800(void)      //显示函数
{
////显示测试////
//count=7;
/*
SEG_1=1;
SEG_2=2;
SEG_3=3;
SEG_4=4;
SEG_5=5;
SEG_6=6;
SEG_7=7;
SEG_8=8;
*/
////////////////////利用计数器不同时间显示不同内容，完成闪烁显示/////////////////
		jsq_set_xianshi++;
////////////////////调表显示/////////////////
if(jsq_function==1||jsq_function==2||jsq_function==3)
{
		SEG_1=jsq_1hours/10;								//显示时的十位//
		SEG_2=jsq_1hours%10;								//显示时的个位//
		SEG_3=16;
		SEG_4=jsq_1min/10;								//显示分的十位//
		SEG_5=jsq_1min%10;								//显示分的个位//
		SEG_6=16;
		SEG_7=jsq_1s/10;								//显示秒数的十位//
		SEG_8=jsq_1s%10;								//显示秒数的个位//
}
////////////////////闹铃显示///////////////	
if(jsq_function==4||jsq_function==5||jsq_function==6)
{
		SEG_1=jsq_naoling_1hours/10;								//显示时的十位//
		SEG_2=jsq_naoling_1hours%10;								//显示时的个位//
		SEG_3=16;
		SEG_4=jsq_naoling_1min/10;								//显示分的十位//
		SEG_5=jsq_naoling_1min%10;								//显示分的个位//
		SEG_6=16;
		SEG_7=jsq_naoling_1s/10;								//显示秒数的十位//
		SEG_8=jsq_naoling_1s%10;								//显示秒数的个位//
}
		if(jsq_function==1&&jsq_set_xianshi<=100)
			{
			SEG_1=17;SEG_2=17;
			}		
		if(jsq_function==2&&jsq_set_xianshi<=100)
			{
			SEG_4=17;SEG_5=17;
			}
		if(jsq_function==3&&jsq_set_xianshi<=100)
			{
			SEG_7=17;SEG_8=17;
			}
///////////////////////////////////////////////////////////
		if(jsq_function==4&&jsq_set_xianshi<=100)
			{
			SEG_1=17;SEG_2=17;
			}		
		if(jsq_function==5&&jsq_set_xianshi<=100)
			{
			SEG_4=17;SEG_5=17;
			}
		if(jsq_function==6&&jsq_set_xianshi<=100)
			{
			SEG_7=17;SEG_8=17;
			}
		if(jsq_set_xianshi>200){jsq_set_xianshi=0;}
//////////////显示程序/////////////////////////////
P0=table[SEG_1];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存
P0=~0x10;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
     delay500us();///延时500us
/////////黑屏显示//////////////////////
P0=table[17];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存//////clk信号
P0=~0x00;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
/////////2位显示//////////////////////
P0=table[SEG_2];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存
P0=~0x20;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
     delay500us();///延时500us
/////////黑屏显示//////////////////////
P0=table[17];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存//////clk信号
P0=~0x00;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
/////////3位显示//////////////////////
P0=table[SEG_3];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存
P0=~0x40;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
     delay500us();///延时500us
/////////黑屏显示//////////////////////
P0=table[17];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存//////clk信号
P0=~0x00;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
/////////4位显示//////////////////////
P0=table[SEG_4];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存
P0=~0x80;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
     delay500us();///延时500us
/////////黑屏显示//////////////////////
P0=table[17];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存//////clk信号
P0=~0x00;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
/////////5位显示//////////////////////
P0=table[SEG_5];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存
P0=~0x01;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
     delay500us();///延时500us
/////////黑屏显示//////////////////////
P0=table[17];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存//////clk信号
P0=~0x00;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
/////////6位显示//////////////////////
P0=table[SEG_6];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存
P0=~0x02;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
     delay500us();///延时500us
/////////黑屏显示//////////////////////
P0=table[17];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存//////clk信号
P0=~0x00;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
/////////7位显示//////////////////////
P0=table[SEG_7];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存
P0=~0x04;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
     delay500us();///延时500us
/////////黑屏显示//////////////////////
P0=table[17];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存//////clk信号
P0=~0x00;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
/////////8位显示//////////////////////
P0=table[SEG_8];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存
P0=~0x08;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
     delay500us();///延时500us
/////////黑屏显示//////////////////////
P0=table[17];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存//////clk信号
P0=~0x00;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
}
///////////////////////////////////////////////////
//函数名称:void key_init(void)
//函数功能:按键初始化函数
//入口参数:
//出口参数:
//函数说明:P3口是准双向口所以准备读取按键（按键输入）前要向P3口写“1”关闭P3口接地的场效应
///////////////////////////////////////////////////
void key_init(void)      //按键初始化函数
  {
  P3=0xff;/////初始化P3口准备读取按键（按键输入）
  }
///////////////////////////////////////////////////
//函数名称:void LED_init(void)
//函数功能:LED初始化、自检函数
//入口参数:
//出口参数:
//函数说明:采用全部显示的方法解决初始化问题
///////////////////////////////////////////////////
void LED_init(void)      //LED初始化函数
  { 
//////////////多次闪烁显示程序/////////////////////////////
	unsigned char i; /////局部变量定义
  	for(i=3;i>0;i--)   //循环闪烁
	 {
		L1=0;L2=0;L3=0;L4=0;L5=0;L6=0;L7=0;L8=0;
		delay02s();///延时0.2s
		delay02s();///延时0.2s
		delay02s();///延时0.2s
		delay02s();///延时0.2s
		delay02s();///延时0.2s
		delay02s();///延时0.2s
		delay02s();///延时0.2s
		delay02s();///延时0.2s
		L1=1;L2=1;L3=1;L4=1;L5=1;L6=1;L7=1;L8=1;
		delay02s();///延时0.2s
		delay02s();///延时0.2s
		delay02s();///延时0.2s
		delay02s();///延时0.2s
		delay02s();///延时0.2s
		delay02s();///延时0.2s
		delay02s();///延时0.2s
		delay02s();///延时0.2s
	 }
  }
///////////////////////////////////////////////////
//函数名称:void SEG_init(void)
//函数功能:数码管初始化、自检函数
//入口参数:
//出口参数:
//函数说明:采用全部显示的方法解决初始化问题
///////////////////////////////////////////////////
void SEG_init(void)      //数码管初始化函数
  {
//////////////持续显示程序/////////////////////////////
	unsigned char i; /////局部变量定义
	unsigned char j; /////局部变量定义
  	for(i=9;i>0;i--)   //最外层循环
		{

			SEG_1=i,SEG_2=i,SEG_3=i,SEG_4=i,SEG_5=i,SEG_6=i,SEG_7=i,SEG_8=i;
  	for(j=100;j>0;j--)   //最外层循环
		{

//display_seg_HC6800();      //显示函数
//////////////显示程序/////////////////////////////
P0=table[SEG_1];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存
P0=~0x01;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
     delay500us();///延时500us
/////////黑屏显示//////////////////////
P0=table[17];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存//////clk信号
P0=~0x00;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
/////////2位显示//////////////////////
P0=table[SEG_2];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存
P0=~0x02;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
     delay500us();///延时500us
/////////黑屏显示//////////////////////
P0=table[17];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存//////clk信号
P0=~0x00;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
/////////3位显示//////////////////////
P0=table[SEG_3];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存
P0=~0x04;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
     delay500us();///延时500us
/////////黑屏显示//////////////////////
P0=table[17];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存//////clk信号
P0=~0x00;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
/////////4位显示//////////////////////
P0=table[SEG_4];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存
P0=~0x08;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
     delay500us();///延时500us
/////////黑屏显示//////////////////////
P0=table[17];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存//////clk信号
P0=~0x00;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
/////////5位显示//////////////////////
P0=table[SEG_5];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存
P0=~0x10;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
     delay500us();///延时500us
/////////黑屏显示//////////////////////
P0=table[17];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存//////clk信号
P0=~0x00;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
/////////6位显示//////////////////////
P0=table[SEG_6];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存
P0=~0x20;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
     delay500us();///延时500us
/////////黑屏显示//////////////////////
P0=table[17];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存//////clk信号
P0=~0x00;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
/////////7位显示//////////////////////
P0=table[SEG_7];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存
P0=~0x40;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
     delay500us();///延时500us
/////////黑屏显示//////////////////////
P0=table[17];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存//////clk信号
P0=~0x00;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
/////////8位显示//////////////////////
P0=table[SEG_8];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存
P0=~0x80;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
     delay500us();///延时500us
/////////黑屏显示//////////////////////
P0=table[17];//////数据从P0口送出到IC7---74HC573锁存器
P26=0;P26=1;P26=0;///IC7数据锁存//////clk信号
P0=~0x00;//////位码从P0口送出到IC6---74HC573锁存器
P27=0;P27=1;P27=0;///IC6位码数据锁存
		}
}
		SEG_1=16,SEG_2=16,SEG_3=16,SEG_4=16,SEG_5=16,SEG_6=16,SEG_7=16,SEG_8=0;//单个显示0，说明数码管准备完成

}

///////////////////////////////////////////////////
//函数名称:void alarm_buzzer(void)
//函数功能:交流蜂鸣器自检程序
//入口参数:
//出口参数:
//函数说明:
///////////////////////////////////////////////////
void alarm_buzzer(void)		//交流蜂鸣器自检程序//
  { 		
	//unsigned char k; /////局部变量定义
	unsigned int k; /////局部变量定义
	//for(k=248;k>0;k--) ////内层循环
	for(k=4096;k>0;k--) ////内层循环
		{
		FMQ=1;
		delay500us();
		FMQ=0;
		delay500us();
		}
  }  
///////////////////////////////////////////////////
//函数名称:void delay50us(void)
//函数功能:延时50us秒的子程序
//入口参数:
//出口参数:
//函数说明:
///////////////////////////////////////////////////
void delay50us(void)		//延时50us的子程序//
  { 		
	unsigned int k; /////局部变量定义
	for(k=50;k>0;k--) ////内层循环
		{
		;
		}

  }  
///////////////////////////////////////////////////
//函数名称:void int_time1(void)
//函数功能:定时器t1初始化
//入口参数:
//出口参数:
//函数说明:
///////////////////////////////////////////////////
void int_time1(void) 
{
//	TMOD=0x01;			//定义为定时器0方式1,SFR中TMOD位于不能被8整除的地址,所以要按字节方式赋值//
//////////t1设置/////////////////////////////////////////
	TH1=(65536-500)/256;					//赋初值//
	TL1=(65536-500)%256;
	ET1=1;									//开启定时器1溢出中断//
	EA=1;
//	TR1=1;								//开启定时器1//
}
///////////////////////////////////////////////////
//函数名称:void	interrupt_t1(void)	interrupt	3
//函数功能:t1中断函数
//入口参数:
//出口参数:
//函数说明:
///////////////////////////////////////////////////
void	interrupt_t1(void)	interrupt	3		//定时器1溢出中断//
{
	TH1=(65536-500)/256;					//赋初值//
	TL1=(65536-500)%256;

FMQ=!FMQ;

}

